import { Fragment, useState } from "react";
import BlogPopup from "./popup/BlogPopup";
import Image from "next/image";

const News = () => {
  const props = {
    dots: false,
    infinite: true,
    arrows: false,
    speed: 500,
    slidesToShow: 5,
    slidesToScroll: 1,
    initialSlide: 0,
    responsive: [
      {
        breakpoint: 1200,
        settings: {
          slidesToShow: 5,
        },
      },
      {
        breakpoint: 1024,
        settings: {
          slidesToShow: 4,
        },
      },
      {
        breakpoint: 600,
        settings: {
          slidesToShow: 2,
        },
      },
      {
        breakpoint: 480,
        settings: {
          slidesToShow: 2,
        },
      },
    ],
  };
  const blogData = [
    {
      title: "עיסוי פנים",
      img: "/img/news/1.jpg",
      dec: [
        `המטרה:
        📍להפעיל את משאבים הפנימיים של הגוף
        📍לעודד מטבוליזם של תאי העור ורקמות אחרות תוך ניצול של פוטנציאל הטבעי של העור לחדש ולשמר את עצמו.
        📍לחזק טונוס שרירי הפנים.
        📍להריץ מקרו-סירקולציה של שכבת שומן תת עורית במחזור הדם והקרקפת.
        📍לשפר את זרימת הדם והלימפה.
        מה אנחנו מקבלים:
        👈שיפור טונוס ואלסטיות של השרירים ע"י שחרור מקסימלי של השרירי הפנים.
        👈הקלה בעוויתות וחסימות.
        👈שיפור משמעותי בנראות עור הפנים – זוהר יותר, חלק יותר ובריא יותר.
        👈הפעלת חילוף חומרים והמרצת מחזור הדם.
        👈ניקוז לימפתי.
        👈כושר פסיבי של שרירי הפנים.
        👈גירוי תאים פיברובלסטים להגברת ייצור אלסטין וקולוגן.
        👈העלמת בצקות (גם לאחר בוטוקס).
        👈אפקט אנטי סטרס.`,
      ],

      date: "",
    },
    {
      title: "אקנה",
      img: "/img/news/2.jpg",
      dec: [
        'הגורמים: \
        פצעי בגרות - אקנה, היא מחלת עור נפוצה, שפוגעת בזקיקי השיער ובלוטות החלב התת-עוריות, המפרישות חומר שומני סבום  \
        sebus\
        הנגרם עקב עלייה בפעילות הורמוני המין במהלך גיל ההתבגרות, אך חלק מהמבוגרים עלולים להמשיך לסבול מהמחלה גם בגילאי 40-30\
        כ- 80% מהמתבגרים, בגילאי 13-18, יסבלו מאקנה בדרגת חומרה זו או אחרת.\
        בהעדר טיפול מתאים או אי מתן טופל בזמן או טיפול בצורה לקויה עשויים לגרום בעתיד להופעת צלקות ופיגמנטציה \
         למרות שמדובר במחלת עור, המחלה עשויה לגרום להשפעה פסיכולוגית משמעותית, המתבטאת בפגיעה בביטחון האישי ודימוי עצמי של בני נוער.\
        הטיפול\
        בהחלט ניתן לטפל באקנה ולמנוע את התפרצות קשה ובעתיד את גם צלקות ופיגמנטציה, באמצעות טיפול מותאם נכון בקליניקה ע"י ניקוי עדין וחומרים ומסכות פעילים המאזנים את הפרשת הסבום וכמובן להמשיך טיפול משמר בבית בין הטיפולים בקליניקה. \
         פוטותרפיה \
        אחד השיטות טיפול המתקדמת, מבוססת על גלי אור כחול או אור אדום באורכים שונית, המגיעות לעומק העור ופוגעות בחיידק הנקרה פי אקנה ומפחיתה את הנגעים הדלקתיים בעור.\
        יעיל בטיפול בכל סוגי האקנה\
        ',
      ],
      date: "",
    },
    {
      title: "פיגמנטציה",
      img: "/img/news/3.jpg",
      dec: [
        'בואו נדבר על פיגמנטציה...\
        פיגמנטציה היא בעיקר בעיה אסתטית והיא נוצרת במהלך השנים עקב חשיפה ממושכת לשמש, שינויים הורמונליים כגון הריון, לקיחת גלולות וגם אקנה בעבר ברוב המקרים יצור פיגמנטציה.\
        בעור שלנו ישנם תאים הנקראים מלנוציטים המייצרים פיגמנט הנקרא מלנין שמגן על עור בכל פעם שאנחנו נחשפים לשמש.\
        החשיפה הממושכות לשמש מזיקה לעור שלנו ומזרזת את הזדקנות העור ובנוסף ייצור ופיזור מלנין באופן לקוי (לא אחיד) גורם להיווצרות כתמי פיגמנטציה.\
        פיגמנטציה בהריון נגרמת כאמור כתוצאה משינויים הורמונליים וברוב המקרים היא עוברת, לפחות חלקית, לאחר הלידה ולאחר איזון הורמונלי. ועדיין, לעיתים נותרים כתמים עדינים הנראים לעין.\
        טיפול בפיגמנטציה \
        1.	שימוש בתכשירי פילינג חומצות המחדשות את תאי העור המסייע להיפטר מתאי העור המלאים במלנין כולל החדרת חומרים פעילים המעכבים את ייצור המלנין והויטמינים. \
        הטיפול מתבצע בקליניקה ע"י קוסמטיקאית מקצועית.\
        2.	בחירה והתאמה מקצועית של תכשירים ייעודיים לטיפול בפיגמנטציה, \
        להמשך טיפול עצמאי בבית, אשר יעכבו את ייצור המלנין באזורים בעייתיים.\
        3.	אנטיאוקסידנטים: מומלץ לבחור תכשירים שכוללים בתוכם ויטמין C. לאחרונה פותחו טכנולוגיות מתקדמות של תכשירים עם יכולת חדירה אל תוך שכבה עמוקה של העור התורמים להבהרה של כתמי פיגמנטציה, והם גם נוגדי חמצון.\
        4.	לתוצאות מקסימליות בטיפול בפיגמנטציה יש חשיבות רבה להמשך טיפול ביתי יחד עם הטיפול המקצועי בקליניקה ע"י סדרת תכשירי הבהרה ומדכאי מלנין \
        5.	רוב תכשירים לטיפול בפיגמנטציה כוללים חומר שנקרא רטינול\
        •	נשים בהריון – יש לבחור תכשירים – ללא רטינול שעלול לפגוע בהתפתחות התינוק.\
        נשים מניקות – יש להתייעץ עם הרופא המטפל לפני שימוש בתכשירים המכילים את החומר.\
        ',
      ],
      date: "",
    },
    {
      title: "אנטיאייג'ינג",
      img: "/img/news/4.jpg",
      dec: [
        "טיפולי אנטיאייג'ינג לגיל מתבגר\
        ככל שאנו מתבגרים,  תהליך ההתחדשות של תאי העור הופך להיות פחות יעיל. העור נעשה דק יותר ומאבד מגמישותו . בעקבות זאת מתחילים להופיע קימטוטים, העור מפחית מהברק והלחות שלו, כלי הדם מתרחבים ובהרבה מקרים מתחילה להופיע גם פיגמנטציה. \
        לכן העור זקוק לתשומת לב וטיפולים מיוחדים תוך התחשבות במאפייני העור ובתוצאה הרצויה.\
        הטיפול הבסיסי והחשוב ביותר (בכל גיל ובמיוחד בגיל המתבגר) הוא העשרת העור בלחות בקרמים שמכילים חומצה היאלורונית, פפטידים וויטמינים... (הטכנולוגיות של היום מאפשרות חדירה מושלמת של חומרים דרך תאי העור אל שכבות עמוקות המאפשרת לבצע תהליכי התחדשות. \
        טיפולים קוסמטיים יכולים לעזור משמעותית לשמור על עור בריא ומוצק יותר. \
        אחד ההליכים הפופולריים ביותר לעור בוגר הם טיפולי אנטיאיג'נג עם תכשירים (עם מכשור או ללא) ע\"י פילינגים יעילים המסייעים להגברת התחדשות של תאי העור, החדרת קוקטיילים, ויטמינים ומסכות להגברת ייצור קולגן המסייע לעור שלנו להראות בריא יותר, חזק והדוק ולהגיע לגמישות רבה.\
        טיפולים קוסמטיים קבועים יחד עם טיפולים משמרים בבית בין הטיפולים בקליניקה, יסייעו לשמור על עור צעיר, יפה ואסתטי במשך שנים רבות.\
        ",
      ],
      date: "",
    },
  ];
  const [activeBlogData, setActiveBlogData] = useState();
  const [activeBlog, setActiveBlog] = useState(false);
  return (
    <Fragment>
      <BlogPopup
        close={() => setActiveBlog(false)}
        show={activeBlog}
        blogData={activeBlogData}
      />
      <div className="tonni_tm_section" id="news">
        <div className="tonni_tm_news">
          <div className="container bigger">
            <div className="news_inner">
              <div className="container">
                <div className="tonni_tm_main_title" data-type="flex">
                  <div className="title">
                    <span>הטיפולים שלנו</span>
                    <h3 className="news-h3">גורמים ודרכי טיפול</h3>
                  </div>
                  <div className="subtitle">
                    <p>
                      מגוון טיפולים מיוחדים אשר נועדו לתת מענה אפקטיבי ללא
                      הזרקות וחומרים כימיים בנוסף לנתינת הרגשה חיובית ונעימה
                    </p>
                  </div>
                </div>
                <div className="news_list">
                  <ul>
                    {blogData.map((blog, i) => (
                      <li
                        className="wow fadeInUp"
                        data-wow-duration="1s"
                        data-wow-delay={`0.${i * 2}s`}
                        key={i}
                      >
                        <div className="list_inner">
                          <div className="image">
                            {/* Replace img with Image */}
                            <Image
                              src={blog.img}
                              alt=""
                              width={400}
                              height={300}
                            />
                            <div
                              className="main"
                              data-img-url={blog.img}
                              style={{
                                backgroundImage: `url(${blog.img})`,
                              }}
                            />
                            <a
                              className="tonni_tm_full_link c-pointer"
                              onClick={() => {
                                setActiveBlog(true);
                                setActiveBlogData(blog);
                              }}
                            />
                          </div>
                          <div className="details">
                            <span className="date">{blog.date}</span>
                            <h3 className="title">
                              <a
                                className="c-pointer"
                                onClick={() => {
                                  setActiveBlog(true);
                                  setActiveBlogData(blog);
                                }}
                              >
                                {blog.title}
                              </a>
                            </h3>
                          </div>
                        </div>
                      </li>
                    ))}
                  </ul>
                  <span className="shape">
                    <Image
                      src="/img/svg/icon8.svg"
                      alt=""
                      width={145}
                      height={145}
                      className="svg"
                    />
                  </span>
                  <span className="shape2">
                    <Image
                      src="/img/svg/icon5.svg"
                      alt=""
                      width={45}
                      height={45}
                      className="svg anim_circle"
                    />
                  </span>
                  <span className="shape3">
                    <Image
                      src="/img/svg/icon10.svg"
                      alt=""
                      width={75}
                      height={75}
                      className="svg"
                    />
                  </span>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </Fragment>
  );
};
export default News;
